app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Title 1"], ["text", "Text for blog post 1. Blah blah blah."], ["created_at", "2015-02-13 23:56:14.920183"], ["updated_at", "2015-02-13 23:56:14.920183"]]